In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city and ride data files and store them in pandas DataFrames.
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [12]:
# 120 rows, 3 columns ['city', 'driver_count', 'type'], [object, int, object]
# no nulls, 'city' is unique
# types are ['Urban', 'Suburban', 'Rural'] with 66, 36, 18 cities each
# driver count ranges from 1 to 73, mean 25, median 20.5

city_data_df.describe()

       driver_count
count    120.000000
mean      24.775000
std       20.277678
min        1.000000
25%        7.000000
50%       20.500000
75%       38.250000
max       73.000000

In [18]:
# 2375 rows, no nulls
# 4 columns ['city', 'date', 'fare', 'ride_id'], [obj, obj, float, int]
# ride-id unique, 120 cities, fare ranges from 4.05 to 58.55, mean,median=26.5

ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [19]:
import datetime

In [21]:
ride_data_df['realdate'] = ride_data_df['date'].map(lambda x: datetime.datetime.fromisoformat(x))

In [27]:
# min '2019-01-01 00:08:16' , max '2019-05-08 13:10:18'
ride_data_df['realdate'].max()

Timestamp('2019-05-08 13:10:18')

In [28]:
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [29]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,realdate,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,2019-01-14 10:14:22,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,2019-03-04 18:24:09,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,2019-02-24 04:29:00,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,2019-02-10 23:22:03,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,2019-03-06 04:28:35,46,Urban